app/Controllers/Cliente.php

SELECT *
FROM `cliente`
WHERE `email` = 'beatriceximenes13@gmail.com'
 LIMIT 1
SELECT *
FROM `cliente`
WHERE `celular` = '21993526236'
 LIMIT 1
INSERT INTO `cliente` (`nome`, `email`, `celular`, `data_nas`, `senha`, `codigo_verificacao`, `verificado`) VALUES ('Beatriz', 'beatriceximenes13@gmail.com', '21993526236', NULL, '123456', 817439, 0)
INSERT INTO `endereco` (`rua`, `complemento`, `bairro`, `municipio`, `estado`, `cep`, `tipo`, `idReferencia`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, 'cliente', 5)
---
    public function salvar()
    {

        $clienteModel = new Cliente_Model();

        $celular = preg_replace('/\D/', '', $this->request->getPost('celular'));

        if (strlen($celular) != 11) {
            return redirect()->back()->with('erro', 'Número inválido');
        }

        $email = $this->request->getPost('email');

        if ($clienteModel->where('email', $email)->first()) {
            return redirect()->back()->with('erro', 'Email já cadastrado');
        }

        if ($clienteModel->where('celular', $celular)->first()) {
            return redirect()->back()->with('erro', 'Celular já cadastrado');
        }

        $codigo = rand(100000, 999999);



        $clienteId = $clienteModel->insert([
            'nome' => $this->request->getPost('nome'),
            'email' => $email,
            'celular' => $celular,
            'data_nas' => $this->request->getPost('data_nas'),
            'senha' => $this->request->getPost('senha'),
            'codigo_verificacao' => $codigo,
            'verificado' => 0
        ], true);

        $enderecoModel = new \App\Models\EnderecoModel();

        $enderecoModel->insert([
            'rua'         => $this->request->getPost('rua'),
            'complemento' => $this->request->getPost('complemento'),
            'bairro'      => $this->request->getPost('bairro'),
            'municipio'   => $this->request->getPost('municipio'),
            'estado'      => $this->request->getPost('estado'),
            'cep'         => $this->request->getPost('cep'),
            'tipo'        => 'cliente',
            'idReferencia'=> $clienteId
        ]);

SELECT *
FROM `cliente`
WHERE `cliente`.`id` = '5'
SELECT *
FROM `endereco`
WHERE `idReferencia` = '5'
AND `tipo` = 'cliente'
 LIMIT 1
---
    public function perfil()
    {
        $clienteModel = new \App\Models\Cliente_Model();
        $enderecoModel = new \App\Models\EnderecoModel();

        $id = session()->get('id');

        $cliente = $clienteModel->find($id);

        $endereco = $enderecoModel
            ->where('idReferencia', $id)
            ->where('tipo', 'cliente')
            ->first();