app/Controllers/Doador.php

SELECT *
FROM `roupas`
WHERE `idDoador` = '1'
---
    public function index()
    {
        $this->verificarLogin();
        $this->limparDoacoes();

        $model = new \App\Models\RoupaModel();

        $itens = $model
            ->where('idDoador', session()->get('id'))
            ->findAll();

SELECT *
FROM `doador`
WHERE `email` = 'beatriceximenes13@gmail.com'
 LIMIT 1
---
    public function salvar()
    {
        $doadorModel = new DoadorModel();
        $enderecoModel = new EnderecoModel();

        // 🔥 VALIDAÇÃO AQUI
        $celular = preg_replace('/\D/', '', $this->request->getPost('celular'));

        if (strlen($celular) != 11) {
            return redirect()->back()->with('erro', 'Número inválido');
        }


            // 🔍 limpar celular
        $celular = preg_replace('/\D/', '', $this->request->getPost('celular'));

        // 🔍 validar tamanho
        if (strlen($celular) != 11) {
            return redirect()->back()->with('erro', 'Número inválido');
        }

        $email = $this->request->getPost('email');

        // 🔥 VERIFICAR EMAIL
        $existeEmail = $doadorModel->where('email', $email)->first();

SELECT *
FROM `doador`
WHERE `celular` = '21993526236'
 LIMIT 1
---
        }

        // 🔥 VERIFICAR CELULAR
        $existeCelular = $doadorModel->where('celular', $celular)->first();

INSERT INTO `doador` (`nome`, `email`, `celular`, `data_nas`, `senha`, `codigo_verificacao`, `verificado`, `ultimo_acesso`) VALUES ('Beatriz', 'beatriceximenes13@gmail.com', '21993526236', NULL, '123456', 320868, 0, '2026-05-10 00:36:45')
---
        $codigo = rand(100000, 999999);


        $doadorId = $doadorModel->insert([
            'nome'      => $this->request->getPost('nome'),
            'email'     => $this->request->getPost('email'),
            'celular'   => $celular,
            'data_nas'  => $this->request->getPost('data_nas'),
            'senha'     => $this->request->getPost('senha'),
            'codigo_verificacao' => $codigo,
            'verificado' => 0, // 🔥 FALTAVA ISSO
            'ultimo_acesso' => date('Y-m-d H:i:s')
        ]);

SELECT *
FROM `doador`
WHERE `doador`.`id` = '4'
---
    public function verificar($id)
    {
        $model = new DoadorModel();
        $doador = $model->find($id);